src/test/resources/GetAbrahamLincolnsBirthday.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:dat="http://www.27seconds.com/Holidays/US/Dates/">
   <soap:Header/>
   <soap:Body>
      <dat:GetAbrahamLincolnsBirthday>
         <dat:year>2019</dat:year>
      </dat:GetAbrahamLincolnsBirthday>
   </soap:Body>
</soap:Envelope>